#использовать "../src"
#Использовать asserts
#Использовать logos

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьЧтениеОписаниеПакетаYAML");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьЧтениеОписаниеПакетаOS");

	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьЧтениеОписаниеПакетаYAML() Экспорт

	МетаданныеПакета = Новый МетаданныеПакета;

	МетаданныеПакета.ПрочитатьФайлОписанияПакета("./tests/fixtures/packagedef.yaml");

	Утверждения.ПроверитьРавенство(МетаданныеПакета.Имя, "Тестовый_пакет", "Значения должны быть равны");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтениеОписаниеПакетаOS() Экспорт

	МетаданныеПакета = Новый МетаданныеПакета;

	МетаданныеПакета.ПрочитатьФайлОписанияПакета("./tests/fixtures/packagedef");

	Утверждения.ПроверитьРавенство(МетаданныеПакета.Имя, "Тестовый_пакет", "Значения должны быть равны");
	Утверждения.ПроверитьРавенство(МетаданныеПакета.Зависимости.Получить("logos"), "1.0.0", "Значения должны быть равны");
	Утверждения.ПроверитьРавенство(МетаданныеПакета.ОбъявлениеМодулей.Классы.Получить("Вселенная"), "src/core/Классы/Вселенная.os", "Значения должны быть равны");
	Утверждения.ПроверитьРавенство(МетаданныеПакета.Автор.Имя, "test", "Значения должны быть равны");
	Утверждения.ПроверитьРавенство(МетаданныеПакета.Автор.Емайл, "test@gmail.com", "Значения должны быть равны");

КонецПроцедуры

Лог = Логирование.ПолучитьЛог("oscript.lib.configor.constructor");
Лог.Отладка(УровниЛога.Отладка);

